app/controllers/quotes_controller.rb

  def index
    @quotes = Quote.ordered
---
SELECT "quotes".* FROM "quotes"

  def create
    @quote = Quote.new(quote_params)

    if @quote.save
---
INSERT INTO "quotes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "thai"], ["created_at", "2023-03-01 07:02:15.252889"], ["updated_at", "2023-03-01 07:02:15.252889"]]

  def update
    if @quote.update(quote_params)
---
UPDATE "quotes" SET "name" = $1, "updated_at" = $2 WHERE "quotes"."id" = $3  [["name", "thai 2"], ["updated_at", "2023-03-01 07:02:52.759144"], ["id", 980190963]]

  def destroy
    @quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = $1  [["id", 980190962]]

  def set_quote
    @quote = Quote.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]